In [1]:
import pandas as pd

### Pandas Data Types

In [6]:
# 2 main datatypes Series (1 Dimensional) and DataFrame (2 Dimensional)
series = pd.Series(["BMW", "Toyota", "Honda"])
colors = pd.Series(["Blue", "Red", "White"])

In [42]:
# DataFrame = 2 dimensional
car_data = pd.DataFrame({"Car make": series, "Color": colors})
car_data["Car make"]

0       BMW
1    Toyota
2     Honda
Name: Car make, dtype: object

In [41]:
# Import data
car_sales = pd.read_csv("car-sales.csv")
car_sales.Brand.head()

0              BMW
1    Mercedes-Benz
2    Mercedes-Benz
3             Audi
4           Toyota
Name: Brand, dtype: object

In [18]:
# Exporting a data frame
# index = False to stop forced indexing of the csv rows
car_sales.to_csv("exported-car-sales.csv", index = False)
# car_sales.to_exel("exported-car-sales.xl")

In [20]:
# import exported csv
car_sales_exported = pd.read_csv("exported-car-sales.csv")
car_sales_exported.head()

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500
3,Audi,23000.0,crossover,240,4.2,Petrol,yes,2007,Q7
4,Toyota,18300.0,crossover,120,2.0,Petrol,yes,2011,Rav 4

### Describe Data

In [24]:
# Attribute / Prop : extra info about (properties of) a data frame (Object)
car_sales.dtypes

Brand            object
Price           float64
Body             object
Mileage           int64
EngineV         float64
Engine Type      object
Registration     object
Year              int64
Model            object
dtype: object

In [25]:
car_sales.columns

Index(['Brand', 'Price', 'Body', 'Mileage', 'EngineV', 'Engine Type',
       'Registration', 'Year', 'Model'],
      dtype='object')

In [29]:
car_sales.index

RangeIndex(start=0, stop=4345, step=1)

In [31]:
# Function : operations on data frame
car_sales.describe()

               Price      Mileage      EngineV         Year
count    4173.000000  4345.000000  4195.000000  4345.000000
mean    19418.746935   161.237284     2.790734  2006.550058
std     25584.242620   105.705797     5.066437     6.719097
min       600.000000     0.000000     0.600000  1969.000000
25%      6999.000000    86.000000     1.800000  2003.000000
50%     11500.000000   155.000000     2.200000  2008.000000
75%     21700.000000   230.000000     3.000000  2012.000000
max    300000.000000   980.000000    99.990000  2016.000000

In [32]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4345 entries, 0 to 4344
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         4345 non-null   object
 1   Price         4173 non-null   float64
 2   Body          4345 non-null   object
 3   Mileage       4345 non-null   int64
 4   EngineV       4195 non-null   float64
 5   Engine Type   4345 non-null   object
 6   Registration  4345 non-null   object
 7   Year          4345 non-null   int64
 8   Model         4345 non-null   object
dtypes: float64(2), int64(2), object(5)
memory usage: 305.6+ KB

In [35]:
# avarages
car_sales.Price.mean()

19418.746935058713

In [36]:
car_sales.Price.sum()

81034430.96000001

In [37]:
car_sales["Price"].sum()

81034430.96000001

In [43]:
len(car_sales)

4345

In [44]:
# last data of a data frame
car_sales.tail()

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model
4340,Mercedes-Benz,125000.0,sedan,9,3.0,Diesel,yes,2014,S 350
4341,BMW,6500.0,sedan,1,3.5,Petrol,yes,1999,535
4342,BMW,8000.0,sedan,194,2.0,Petrol,yes,1985,520
4343,Toyota,14200.0,sedan,31,NaN,Petrol,yes,2014,Corolla
4344,Volkswagen,13500.0,van,124,2.0,Diesel,yes,2013,T5 (Transporter)

In [50]:
# .loc & .iloc : Getting data from location id and index location
print(colors.loc[1], colors.loc[2], colors.loc[0])

Red White Blue